#!/bin/bash
echo "******************************************************************************"
echo "__  _______  _    ____  _  __     "
echo "\ \/ /_   _|/ \  |  _ \| |/ / 塔   官网网站： www.xtark.cn"
echo " \  /  | | / _ \ | |_) | ' /  克   淘宝店铺： https://xtark.taobao.com"
echo " /  \  | |/ ___ \|  _ <| . \  创   塔克微信： 塔克创新（获取最新资讯）"
echo "/_/\_\ |_/_/   \_\_| \_\_|\_\ 新   塔克哔哩： space.bilibili.com/511052131"
echo ""
echo "******************************************************************************"
echo " "
echo -e "ROS Master URI: \033[32m$1\033[0m"
echo " "
echo -e "ROS IP: \033[32m$2\033[0m"
echo " "
MASTER_GW=`echo $1 | cut -d "." -f3`
SELF_GW=`echo $2 | cut -d "." -f3`
if [ "$MASTER_GW" != "$SELF_GW" ]; then
	echo -e "\033[33m检测到虚拟机与机器人不在同一网段，请检查网络配置！\033[0m"
fi

